# Документация пользователя ASMovies

ASMovies - это мобильное приложение, которое поможет вам быстро и удобно искать киноленты по выбранным фильтрам и добавлять их в избранное. В этой документации вы найдете информацию о том, как пользоваться функциями приложения.

## Поиск фильмов

Для поиска фильмов вы можете использовать различные фильтры, такие как жанр, год выпуска, ключевые слова и название. Для этого перейдите на вкладку "Поиск" и выберите нужные фильтры.

## Просмотр информации о фильмах

Вы можете просмотреть краткую и полную информацию о фильме, перейдя на страницу фильма. На странице фильма вы найдете информацию о режиссере, актерах, оценках, отзывах и многое другое.

## Добавление фильмов в избранное

Вы можете добавлять понравившиеся кинокартины в избранное, нажав на кнопку "Добавить в избранное" на странице фильма. Все добавленные фильмы можно найти на вкладке "Избранное".

## Оставление отзывов и оценок

Вы можете оставлять оценки и отзывы к просмотренным фильмам. Чтобы оставить отзыв, перейдите на страницу фильма и нажмите на кнопку "Оставить отзыв". Вы можете оценить фильм от 1 до 5 звезд.

## Поиск фильмов с регистрацией и без нее

ASMovies позволяет искать кино как с регистрацией, так и без нее. Если вы не хотите регистрироваться, вы можете использовать все функции приложения, кроме сохранения фильмов в избранное.

Хорошего просмотра!
